#+TITLE: Visualization of HP flow QC data
#+DATE: 2014-12-15
#+PROPERTY: header-args:R :session *R* :exports both :results output replace

** plots
#+BEGIN_SRC R
outdir <- 'output'

# Plotting TubeStat data (total events, percent of events passing various filters) over time
pdf(paste(outdir, 'TubeStats_count_lines.pdf', sep='/'), 16, 12)
variables <- c('ptransform', 'pviable', 'psinglet')

for (var in c(variables)) {
  g <- list()
  tmp <- tubestats2 %>%
    filter(stat == var) %>%
      arrange(date)

  # group by cytnum
  g[['cytnum']] <- tmp %>% ggplot(aes(x=date, y=raw, group=cytnum))
  g[['cytnum']] <- g[['cytnum']] + geom_point(aes(colour=cytnum, shape=flag))
  g[['cytnum']] <- g[['cytnum']] + geom_line(aes(y=smooth, colour=cytnum))
  g[['cytnum']] <- g[['cytnum']] + geom_ribbon(aes(ymin=apply(cbind(smooth-1*sd,0) ,1, max),
                                  ymax=apply(cbind(smooth + 1 * sd, 100), 1, min),
                                  alpha=0.1, fill=cytnum)) + scale_alpha_continuous(guide='none')
  g[['cytnum']] <- g[['cytnum']] + labs(title=paste(var, ' over time', sep='')) + ylab('Percent')
  g[['cytnum']] <- g[['cytnum']] + ylim(0,100)
  g[['cytnum']] <- g[['cytnum']] + scale_x_datetime()  # breaks = date_breaks("1 week"))

  for (cyt in unique(tmp$cytnum)) {
      g[[cyt]] <- tmp %>%
        filter(cytnum == cyt) %>%
          ggplot(aes(x=date, y=raw, group=tube_type))
      g[[cyt]] <- g[[cyt]] + geom_point(aes(colour=tube_type, shape=flag))
      g[[cyt]] <- g[[cyt]] + geom_line(aes(y=smooth, colour=tube_type))
      g[[cyt]] <- g[[cyt]] + geom_ribbon(aes(ymin=apply(cbind(smooth-1*sd,0) ,1, max),
                                      ymax=apply(cbind(smooth + 1 * sd, 100), 1, min),
                                      alpha=0.1, fill=tube_type)) + scale_alpha_continuous(guide='none')
      g[[cyt]] <- g[[cyt]] + labs(title=paste(var, ' over time for cytometer #', cyt, sep='')) + ylab('Percent')
      g[[cyt]] <- g[[cyt]] + ylim(0,100)
      g[[cyt]] <- g[[cyt]] + scale_x_datetime()  # breaks = date_breaks("1 week"))
    }
  multiplot(plotlist=g, cols=1)
}

variables <- c('totalevents')
for (var in c(variables)) {
  g <- list()
  dat <- tubestats2 %>%
    filter(stat == var) %>%
      arrange(date)

  ymin = max(min(with(dat, raw - 2 * sd), na.rm=T), 100)
  ymax = max(with(dat, raw + 2 * sd), na.rm=T)

  # group by cytnum
  g[['cytnum']] <- dat %>%
        ggplot(aes(x=date, y=raw, group=cytnum))
  g[['cytnum']] <- g[['cytnum']] + geom_point(aes(colour=cytnum, shape=flag))
  g[['cytnum']] <- g[['cytnum']] + geom_line(aes(y=smooth, colour=cytnum))
  g[['cytnum']] <- g[['cytnum']] + geom_ribbon(aes(ymin=smooth - 1 * sd,
                                  ymax=smooth + 1 * sd,
                                  alpha=0.1, fill=cytnum)) + scale_alpha_continuous(guide='none')
  g[['cytnum']] <- g[['cytnum']] + labs(title=paste(var, ' over time', sep='')) +  ylab('Count')
  g[['cytnum']] <- g[['cytnum']] + scale_y_log10(limits=c(ymin, ymax))
  g[['cytnum']] <- g[['cytnum']] + scale_x_datetime()  # breaks = date_breaks("1 week"))

  for (cyt in unique(tmp$cytnum)) {
      g[[cyt]] <- dat %>%
        filter(cytnum == cyt) %>%
          ggplot(aes(x=date, y=raw, group=tube_type))
      g[[cyt]] <- g[[cyt]] + geom_point(aes(colour=tube_type, shape=flag))
      g[[cyt]] <- g[[cyt]] + geom_line(aes(y=smooth, colour=tube_type))
      g[[cyt]] <- g[[cyt]] + geom_ribbon(aes(ymin=smooth - 1 * sd,
                                             ymax=smooth + 1 * sd,
                                             alpha=0.1, fill=tube_type))
      g[[cyt]] <- g[[cyt]] + scale_alpha_continuous(guide='none')
      g[[cyt]] <- g[[cyt]] + labs(title=paste(var, ' over time', sep='')) +  ylab('Count')
      g[[cyt]] <- g[[cyt]] + scale_y_log10(limits=c(ymin, ymax))
      g[[cyt]] <- g[[cyt]] + scale_x_datetime()  # breaks = date_breaks("1 week"))
    }
  multiplot(plotlist=g, cols=1)
}
dev.off()
#+END_SRC

#+RESULTS:
:  There were 18 warnings (use warnings() to see them)
:  Warning messages:
: 1: In scale$trans$trans(x) : NaNs produced
: 2: Removed 18 rows containing missing values (geom_point).
: 3: Removed 18 rows containing missing values (geom_path).
: null device
:           1


** plots
#+BEGIN_SRC R
outdir <- 'output'

# line plots
variables <- c('mean', 'X50.')
channels <- unique(tmp2$Channel.Name)
channels <- channels[which(!channels %in% c('Time'))]
cytnums <- names(table(tmp$cytnum))[which(as.numeric(table(tmp$cytnum)) > 10)]

pdf(paste(outdir, 'PmtStats_lines.pdf', sep='/'), 10, 5)
for (channel in channels) {
    for (var in variables) {
      dat <- tmp2 %>%
        filter(stat == var & Channel.Name == channel) %>%
          arrange(date)
      ymin <- 0
      ymax <- 1
      g <- dat %>%
            ggplot(aes(x=date, y=raw, group=cytnum))
      g <- g + geom_point(aes(colour=cytnum, shape=flag))
      g <- g + geom_line(aes(y=smooth, colour=cytnum))
      g <- g + geom_ribbon(aes(ymin=smooth - 1 * sd,
                               ymax=smooth + 1 * sd,
                               alpha=0.1, fill=cytnum)) + scale_alpha_continuous(guide='none')
      g <- g + labs(title=paste(channel, ': ', var, ' over time', sep='')) + ylab(var)
      g <- g + ylim(ymin, ymax)
      print(g)
    }
    for (var in c('ptransform')) {
      dat <- tmp2 %>%
        filter(stat == var & Channel.Name == channel) %>%
          arrange(date)
      ymin <- max(with(dat, raw - 2 * sd), 0)
      ymax <- 100
      g <- dat %>%
            ggplot(aes(x=date, y=raw, group=cytnum))
      g <- g + geom_point(aes(colour=cytnum, shape=flag))
      g <- g + geom_line(aes(y=smooth, colour=cytnum))
      g <- g + geom_ribbon(aes(ymin=smooth - 1 * sd,
                               ymax=smooth + 1 * sd,
                               alpha=0.1, fill=cytnum)) + scale_alpha_continuous(guide='none')
      g <- g + labs(title=paste(channel, ': ', var, ' over time', sep='')) +  ylab('Percent')
      g <- g + ylim(ymin, ymax)
      print(g)
    }
  }
dev.off()

pdf(paste(outdir, 'PmtStats_boxes.pdf', sep='/'), 10, 5)
for (channel in channels) {
  for (cyt in cytnums) {
    dat <- tmp %>%
      filter(cytnum == cyt & Channel.Name == channel) %>%
        arrange(date)
    ymin <- 0
    ymax <- 1
    g <- dat %>%
      ggplot(aes(x=date, y=raw_mean, ymin=X25., ymax=X75.))
    g <- g + geom_pointrange()
    g <- g + geom_ribbon(aes(ymin=apply(cbind(0, smooth_mean - 1 * sd_mean),1,function(x) {max(x, na.rm=T)}),
                             ymax=apply(cbind(1, smooth_mean + 1 * sd_mean),1,function(x) {min(x, na.rm=T)}),
                             alpha=0.1)) + scale_alpha_continuous(guide='none')
    g <- g + labs(title=paste(channel, ' on Cyt #', cyt, ' over time', sep='')) + ylab(var)
    g <- g + ylim(ymin, ymax)
    print(g)
    }
  }
dev.off()


## variables <- c()
## for (var in c(variables)) {
##   g <- tmp2 %>%
##     filter(stat == var) %>%
##       arrange(date) %>%
##         ggplot(aes(x=date, y=raw, group=cytnum))
##   g <- g + geom_point(aes(colour=cytnum, shape=flag))
##   g <- g + geom_line(aes(y=smooth, colour=cytnum))
##   g <- g + geom_ribbon(aes(ymin=apply(cbind(smooth-1*sd,0) ,1, max),
##                                   ymax=apply(cbind(smooth + 1 * sd, 100), 1, min),
##                                   alpha=0.1, fill=cytnum)) + scale_alpha_continuous(guide='none')
##   g <- g + labs(title=paste(var, ' over time', sep=''), ylab=var)
##   g <- g + ylim(0,100)
##   print(g)
## }

#+END_SRC

#+RESULTS:
:  There were 50 or more warnings (use warnings() to see the first 50)
: png
:   2
:  There were 28 warnings (use warnings() to see them)
: png
:   2


